; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 162157 2 2 4 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	thermograph0 - mode
	spectrograph3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Phenomenon7 thermograph2)
	(have_image Planet8 spectrograph3)
	(have_image Star9 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   goals met: 0 of 3
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
4. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 0 of 3
5. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 3
6. (turn_to satellite1 star9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star9)
   goals met: 0 of 3
7. (take_image satellite1 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 1 of 3
8. (turn_to satellite1 star3 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star3)
   goals met: 1 of 3
9. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   goals met: 1 of 3
10. (take_image satellite1 planet8 instrument2 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 2 of 3
11. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 3
12. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 2 of 3
13. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 3
14. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 2 of 3
15. (turn_to satellite1 phenomenon7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 3
16. (take_image satellite1 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 3 of 3
